# Этап 1: Сборка
FROM golang:1.22-alpine AS builder

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем исходный код в контейнер
COPY . .

# Собираем приложение
RUN go build -o main .

# Этап 2: Создание минимального образа
FROM alpine:latest

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /root/

# Копируем бинарный файл из этапа сборки
COPY --from=builder /app/main .

# Определяем порт, на котором приложение будет работать
EXPOSE 8080

# Устанавливаем команду для запуска приложения
CMD ["./main"]
